{
    "About": "Giới Thiệu",
    "Projects": "Dự Án",
    "Contact": "Liên Hệ",

    "Welcome to My Journey": "Chào Mừng Đến Với Hành Trình Của Tôi",
    "Explore an interactive timeline of my professional development through an immersive 3D experience.": "Khám phá lộ trình phát triển nghề nghiệp của tôi thông qua trải nghiệm 3D tương tác.",
    "Quick Guide": "Hướng Dẫn Nhanh",
    "Movement": "Di Chuyển",
    "Rotation": "Xoay Cảnh",
    "Animations": "Hoạt Ảnh",
    "Zoom": "Thu Phóng",
    "Left/Right Arrows or Left Mouse": "Mũi Tên Trái/Phải hoặc Chuột Trái",
    "Middle Mouse Button + Drag": "Nút Chuột Giữa + Kéo",
    "Press Q, W, E, or R": "Nhấn Q, W, E, hoặc R",
    "Mouse Wheel": "Bánh Xe Chuột",
    "Click to Start": "Nhấn để Bắt Đầu",
    "Loading assets...": "Đang tải tài nguyên...",
    "Loaded": "Đã tải",
    "of": "của",
    "assets": "tài nguyên",
    "Click to start experience": "Nhấn để bắt đầu trải nghiệm",
    "Loading models": "Đang tải mô hình",

    "view_project": "Xem Dự Án",
    "home_info_1": "Tôi bắt đầu con đường tự học để trở thành kỹ sư phần mềm, phát triển ứng dụng thương mại điện tử cho một công ty địa phương.",
    "home_info_2": "Tôi đến Hoa Kỳ để tiếp tục theo đuổi ngành kỹ thuật phần mềm tại Massachusetts.",
    "home_info_3": "Tôi đến các trung tâm công nghệ ở Hàng Châu, Trung Quốc để nghiên cứu về tuyển dụng và phát triển công nghệ cao.",
    "home_info_4": "Tôi đã hoàn thành hợp đồng kỹ thuật phần mềm tại NVIDIA.",

    "contact_title": "Muốn Hợp Tác Cùng Tôi?",
    "contact_email": "Email",
    "contact_name": "Tên",
    "contact_message": "Lời Nhắn",
    "contact_message_placeholder": "Hãy cho tôi biết tôi có thể giúp gì cho bạn!",
    "contact_send_message": "Gửi Lời Nhắn",
    "contact_sending": "Gửi Lời Nhắn...",

    "about_bio": "Tôi là kỹ sư phần mềm tập trung vào chi tiết với 5 năm kinh nghiệm thực tế về phát triển web full-stack, kỹ thuật phần mềm hệ thống và thực tập kỹ thuật. Với nền tảng vững chắc về các ngôn ngữ như Java, Python, C và C++, tôi thích giải quyết thách thức cả trong phát triển web và ở cấp độ hệ thống. Từ việc tạo giao diện người dùng đẹp mắt đến tối ưu hiệu năng back-end, tôi đam mê xây dựng các giải pháp phần mềm vừa hiệu quả vừa thân thiện với người dùng.",

    "about_greeting": "Xin chào, tôi là",
    "about_name": "Hưng",
    "about_skills": "Kỹ Năng",
    "about_exp": "Kinh Nghiệm",

    "about_exp_title_1": "Kỹ Sư Phần Mềm",
    "about_exp_title_2": "Trưởng Nhóm Kỹ Thuật & Chuyên Viên Phân Tích Thị Trường",
    "about_exp_title_3": "Nhân viên Phát Triển Phần Mềm & Kỹ Thuật",
    "about_exp_title_4": "Trợ Giảng",
    "about_exp_title_5": "Kỹ Sư Phát Triển Web",

    "about_exp_company_1": "NVIDIA",
    "about_exp_company_2": "Công Ty Tư Vấn & Quản Lý Minh Châu",
    "about_exp_company_3": "Học Viện Bách Khoa Worcester",
    "about_exp_company_4": "Công Ty Năng Lượng Mới New England",
    "about_exp_company_5": "Công Ty CP Đầu Tư & Phát Triển Minh Hưng",

    "about_exp_company_1_desc_1": "Đóng góp vào Drive OS, một giải pháp hệ điều hành xe tự hành, bằng cách tích hợp hỗ trợ công cụ phía máy chủ cho bộ xử lý DRIVE Thor.",
    "about_exp_company_1_desc_2": "Phát triển các mô-đun React cho GUI nhằm cải thiện trải nghiệm của người dùng.",
    "about_exp_company_1_desc_3": "Hợp tác cập nhật các biến thể cấu hình bản dựng để tối ưu hóa hiệu suất hiển thị và mở rộng báo cáo lỗi.",
    "about_exp_company_1_desc_4": "Đóng góp vào tài liệu về công cụ và trình điều khiển hiện có để đẩy nhanh quá trình tích hợp các bộ xử lý trong tương lai.",

    "about_exp_company_2_desc_1": "Thiết kế bảng điều khiển và tương tác dữ liệu để trực phân tích xu hướng tuyển dụng.",
    "about_exp_company_2_desc_2": "Xây dựng các quy trình xử lý dữ liệu tự động và xử lý các tập dữ liệu lớn về số liệu thống kê tuyển dụng.",
    "about_exp_company_2_desc_3": "Tạo các thành phần biểu đồ và hệ thống lọc dữ liệu có thể tái sử dụng.",
    "about_exp_company_2_desc_4": "Triển khai các công cụ trực quan hóa và chức năng xuất để đáp ứng truy cập đa nền tảng.",

    "about_exp_company_3_desc_1": "Bắt đầu di chuyển từ WordPress sang kiến ​​trúc React và thiết lập thư viện thành phần và quy trình phát triển.",
    "about_exp_company_3_desc_2": "Tích hợp API Aurora Solar và Google Project Sunroof với React, tạo ra giao diện lập bản đồ tấm pin mặt trời thống nhất.",
    "about_exp_company_3_desc_3": "Duy trì nền tảng WordPress hiện có trong khi dần triển khai các thành phần React cho các tính năng mới.",
    "about_exp_company_3_desc_4": "Phát triển các mô-đun React để ước tính chi phí năng lượng mặt trời.",
    "about_exp_company_3_desc_5": "Tiến hành các nỗ lực lập tài liệu kỹ thuật cho quá trình di chuyển, tạo hướng dẫn cho việc di chuyển thành phần và tích hợp API.",

    "about_exp_company_4_desc_1": "Hướng dẫn sinh viên về các phương pháp tốt nhất trong kỹ thuật phần mềm, bao gồm kiểm soát phiên bản Git, quy trình đánh kiểm duyệt code và phương pháp thử nghiệm.",
    "about_exp_company_4_desc_2": "Dẫn dắt các hội thảo kỹ thuật về kiến ​​trúc thành phần React, quản lý trạng thái và các mô hình phát triển giao diện người dùng.",
    "about_exp_company_4_desc_3": "Hướng dẫn một nhóm gồm mười sinh viên kỹ sư phát triển ứng dụng dựa trên các phương pháp Agile bao gồm lập kế hoạch chạy nước rút và kiểm duyệt code.",
    "about_exp_company_4_desc_4": "Đánh giá và cung cấp phản hồi chi tiết về các bài tập lập trình tập trung vào các nguyên tắc code sạch, tối ưu hóa thuật toán và các mẫu thiết kế phần mềm.",

    "about_exp_company_5_desc_1": "Thiết kế một nền tảng thương mại điện tử đầy đủ chức năng bằng Laravel ở phần backend và React ở phần frontend.",
    "about_exp_company_5_desc_2": "Xây dựng một nền tảng có khả năng mở rộng bằng cách sử dụng kiến ​​trúc model-view-controller của Laravel.",
    "about_exp_company_5_desc_3": "Phát triển giao diện hệ thống quản lý nội dung có thể tùy chỉnh để quản lý hàng tồn kho.",
    "about_exp_company_5_desc_4": "Tạo các thành phần UI phản hồi bằng React để đảm bảo khả năng tương thích trên nhiều trình duyệt và thiết bị di động.",

    "projects_live_demo": "Xem Demo",
    "projects_source_code": "Xem Code",
    "projects_not_deployed": "Chưa Triển Khai",
    "projects_private": "Riêng Tư",

    "project_1_title": "Hồ Sơ Tương Tác 3D",
    "project_2_title": "Hackathon@WPI (GoatHacks)",
    "project_3_title": "Bản Sao Game Bài Gwent",
    "project_4_title": "Thương Mại Điện Tử Minh Hưng JSC",

    "project_1_desc": "Một trang web hồ sơ 3D hấp dẫn với mô hình tương tác, ánh sáng động và hỗ trợ đa ngôn ngữ.",
    "project_2_desc": "Sự kiện hackathon hàng năm do WPI tổ chức, được tài trợ bởi các đối tác như MathWorks và ACM.",
    "project_3_desc": "Một bản sao cá nhân của game bài Gwent từ The Witcher 3, với chiến thuật AI, quản lý trạng thái nâng cao và cơ chế game chân thực.",
    "project_4_desc": "Một nền tảng thương mại điện tử với hệ thống quản lý nội dung tùy chỉnh để quản lý kho hàng."



}